app/controllers/drawings_controller.rb

  def index
    @drawings = Drawing.search(params[:page])
---
SELECT  "drawings".* FROM "drawings" WHERE (name like '%Chess%' ) LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "drawings" WHERE (name like '%Chess%' )

    def set_drawing
      @drawing = Drawing.find(params[:id])
---
SELECT  "drawings".* FROM "drawings" WHERE "drawings"."id" = $1 LIMIT 1  [["id", 3]]