app/controllers/welcome_controller.rb

SELECT  "drawings".* FROM "drawings"  ORDER BY "drawings"."id" DESC LIMIT 3
SELECT COUNT(*) FROM "drawings"
---
  def index
    if not params.has_key?(:page)
      @trending = Drawing.all.paginate(page: 1, per_page: 3)